// 코드 출처 : https://cafe.naver.com/gamepromaster
#include <windows.h>

#ifndef CONSOLE
#define CONSOLE

// typedef struct PROCESS
// {
//     STARTUPINFO si = {0, };
//     PROCESS_INFORMATION pi;	
//     DWORD state;
//     TCHAR command[];			//생성할 프로세스의 소스 or 소스의 경로
// };





//──────────────────────────────────────────────────────
// 화면을 지워주고 커서의 위치를 0,0 으로 이동시키는 함수
//──────────────────────────────────────────────────────
void Clear(void);

//──────────────────────────────────────────────────────
// 커서의 위치를 _x, _y 로 변경하는 함수
//──────────────────────────────────────────────────────
void GotoXY(SHORT _x, SHORT _y);

//──────────────────────────────────────────────────────
// console 창의 title을 변경해 주는 함수
//──────────────────────────────────────────────────────
void SetTitle(LPCTSTR _szConsoleName);

//──────────────────────────────────────────────────────
// 배경색, 글자색을 변경해 주는 함수
//──────────────────────────────────────────────────────
void SetColor(unsigned char _BgColor, unsigned char _TextColor);

//──────────────────────────────────────────────────────
// cursor를 보이게, 안보이게 하는 함수 
//──────────────────────────────────────────────────────
void SetCursor(BOOL _bShow);

//──────────────────────────────────────────────────────
// console 창의 크기를 정하는 함수 ( 디폴트 80, 25 )
//──────────────────────────────────────────────────────
void SetConsoleSize(int _col, int _lines);


//------------------------------------------------------
// 플레이어를 출력하는 함수
//------------------------------------------------------
void PrintPlayer(DWORD PosX, DWORD PosY);


//------------------------------------------------------
// 딜레이해주는 함수
//------------------------------------------------------
void BusyWaiting(void);



#endif
